Tekla.Structures.Model.UI.View.ViewModifyType
The view modification types.

Tekla.Structures.Model.UI.View.ViewModifyType.DOT_MODIFY_VIEW_PROPERTIES
DO NOT USE! For internal usage only!

Tekla.Structures.Model.UI.View.ViewModifyType.DOT_DELETE_VIEW
DO NOT USE! For internal usage only!

Tekla.Structures.Model.UI.View.ViewModifyType.DOT_OPEN_VIEW
DO NOT USE! For internal usage only!

Tekla.Structures.Model.UI.View.ViewModifyType.DOT_CLOSE_VIEW
DO NOT USE! For internal usage only!

Tekla.Structures.Model.UI.View.ViewModifyType.DOT_REDRAW_VIEW
DO NOT USE! For internal usage only!

Tekla.Structures.Model.UI.View.ViewModifyType.DOT_ZOOM_VIEW
DO NOT USE! For internal usage only!